{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.83/4.0"
      ],
      "degree": "Master of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2024-2025",
      "school_name": "University of Toronto"
    },
    {
      "awards_achievements": [
        "Graduated with Distinction",
        "Scholarship for Academic Excellence",
        "Dean's List (2021, 2022)",
        "GPA: 3.70/4.0"
      ],
      "degree": "Bachelor of Engineering Technology",
      "department": "Automation Engineering",
      "duration": "2019-2023",
      "school_name": "McMaster University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KaiqiangZheng",
  "highlighted_projects": [
    {
      "description": "Developed an automated Root Cause Analysis (RCA) engine leveraging large language models (GPT-4 via OpenAI API) and prompt engineering to identify incident root causes from cloud system logs and metrics. Designed a multi-agent architecture that iteratively analyzes and ranks potential causes. Utilized the LEMMA-RCA dataset for evaluation, enabling improved incident triage and decision-making efficiency.",
      "git_url": "https://github.com/KaiqiangZheng1/ECE1786",
      "name": "SherlockGPT: Root Cause Analysis with Large Language Model"
    },
    {
      "description": "Built and deployed a sentiment analysis application in Docker to classify customer service ticket sentiments. Integrated OpenAI API for text analysis and Gradio for an interactive web interface, enabling real-time visualization of sentiment trends and improving customer feedback insights.",
      "git_url": "https://github.com/KaiqiangZheng1/Customer-Sentiment-Analysis",
      "name": "Sentiment Analysis for Customer Service Ticket Analysis"
    },
    {
      "description": "Designed and implemented a full-stack web application using Django, Python, and MySQL for backend logic and data management. Built a responsive frontend using HTML, CSS, Bootstrap, and JavaScript. Containerized the application with Docker for consistent deployment, demonstrating proficiency in full-stack development and cloud deployment workflows.",
      "name": "Full Stack Semester Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Linux cluster monitoring system for Jarvis' LCA team using Docker-contained PostgreSQL to store node performance data. Implemented Bash scripts to automate container lifecycle, database table creation, and data insertion from Linux hardware metrics. Scheduled one-minute interval data collection via crontab and conducted manual testing on GCP virtual machines running Rocky Linux 9. Leveraged Git for version control, centralizing monitoring and reducing manual overhead, enabling administrators to efficiently track system performance and resource usage across multiple clusters.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Curabitur laoreet tristique leo, eget suscipit nisi. Sed in sodales ex. Maecenas vitae tincidunt dui, et eleifend quam.",
        "Grep App: Developed a Java-based application leveraging object-oriented programming principles, designed to function similarly to the Linux grep command. The tool recursively traverses user-specified directories, identifies matches based on user-provided regex patterns, and stores the results in an output file. Java Streams and Lambda expressions were utilized to enhance performance, while Logback was employed for efficient logging. The application was manually tested and debugged using IntelliJ IDEA to ensure reliability. For deployment, a Docker image was created via a custom Dockerfile, with Maven handling dependency management and Git used for version control."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Kaiqiang Zheng",
  "others": [
    {
      "bullets": [
        "AWS Academy Cloud Foundations Badge (2023)",
        "FANUC CERT HandlingTool Operations and Programming (2022)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "3rd Place for Best Design in the International Design and Engineering Education Association (IDEEA) Competition (2023)"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "Fall ECE Graduate Orientation: Assisted the ECE Graduate Office by participating in a mix-and-mingle reception, addressing student inquiries, and providing information and guidance about the program.",
        "Talent Show: Completed a wonderful performance by playing the guitar while maintaining a hard study state.",
        "Teaching Assistant: Provided one-on-one tutoring in mathematics to summer students, covering algebra and calculus."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed and maintained scalable software solutions within an Agile/Scrum framework using Linux, Bash, SQL, Git, Java, and Docker. Contributed to multiple projects, designing and implementing efficient backend systems, optimizing database performance, and streamlining deployment processes. Participated in sprint planning, daily stand-ups, and retrospectives to ensure iterative progress and high-quality delivery. Leveraged big data technologies such as Apache Spark and Databricks to handle large datasets and build robust data processing pipelines.",
      "duration": "2025-present",
      "title": "Software Developer"
    },
    {
      "company": "University of Toronto SG",
      "description": "Developed and maintained responsive web applications using React, HTML, CSS, and integrated Python Flask backends to visualize AI model outputs in real time. Collaborated with graduate researchers to design intuitive UI/UX interfaces and integrate SQL databases for experimental data storage. Implemented multi-agent NLP pipelines using Python and OpenAI API, supported scalable AI workflows, and followed Git-based version control and regular code reviews to ensure robust software practices.",
      "duration": "2024",
      "title": "AI Web Application Research Associate"
    },
    {
      "company": "University of Toronto SG",
      "description": "Utilized software tools to code programs and perform calculations, creating accurate design drawings for engineers and ensuring compliance with specifications. Supported busbar design through programming to assist assembly processes. Managed administrative tasks including enrolling new employees and maintaining records, contributing to smooth operational workflows.",
      "duration": "2022-2023",
      "title": "Design Technician"
    }
  ],
  "skills": {
    "competent": [
      "C++",
      "JavaScript",
      "Docker",
      "Cloud computing (AWS, Azure, GCP)",
      "REST APIs",
      "Flask",
      "React",
      "Angular",
      "Django",
      "JUnit",
      "LaTeX"
    ],
    "familiar": [
      "MATLAB",
      "Maven",
      "Hadoop",
      "Postman",
      "Node.js",
      "Figma"
    ],
    "proficient": [
      "Python",
      "AI/NLP (LLMs, Multi-agent Architecture, OpenAI API, Prompt Engineering, LangChain)",
      "Machine/ Deep Learning (TensorFlow, PyTorch)",
      "Linux/Bash",
      "RDBMS/SQL",
      "Java",
      "HTML/CSS",
      "Databricks",
      "Git",
      "Agile/Scrum"
    ]
  },
  "summary": "I am a Software and AI Engineer with a Master's in Computer Engineering from the University of Toronto and a Bachelor's in Automation Engineering from McMaster University, specializing in AI, software development, and cloud computing. As an AI Web Application Research Associate at UofT, I developed responsive React web applications with Flask backends for real-time AI visualization, built APIs to fetch model outputs, implemented multi-agent LLM pipelines using Python and LangChain, designed efficient data workflows with SQL, and collaborated with researchers to deliver scalable, interactive software solutions. I am passionate about building robust, interactive software systems and applying AI-driven solutions to real-world problems."
}
